src/InformationRegisters/ДокументыАннулирования/ДокументыАннулирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыАннулирования</name>
  <resources>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </resources>
  <resources>
    <name>СоглашениеОбАннулировании</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </resources>
  <resources>
    <name>ФайлСоглашенияОбАннулировании</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </resources>
  <dimensions>
    <name>ЭД</name>
    <type>
      <types>DocumentRef.ЭлектронныйДокументВходящийЭДО</types>
      <types>DocumentRef.ЭлектронныйДокументИсходящийЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ДокументыАннулирования/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаписатьСведенияОбАннулировании(Документ, ЭД, ДокументАннулирования, ФайлАннулирования = Неопределено) Экспорт
	
	Запись = РегистрыСведений.ДокументыАннулирования.СоздатьМенеджерЗаписи();
	
	Запись.Документ = Документ;
	Запись.ЭД = ЭД;
	Запись.СоглашениеОбАннулировании = ДокументАннулирования;
	Запись.ФайлСоглашенияОбАннулировании = ФайлАннулирования;
	
	УстановитьПривилегированныйРежим(Истина);
	Запись.Записать();
	
КонецПроцедуры


#КонецОбласти
